# Используем за основу официальный образ Node.js
FROM node:18-alpine3.15

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все остальные файлы проекта в текущую директорию в контейнере
COPY . .

# Определяем порт, который будет открыт в контейнере
EXPOSE 3000

# Команда, которая будет запускать приложение внутри контейнера
CMD ["npm", "start"]
